{
    "nickname": "Hari 👋",
    "name": "Hari Prasad Kannan",
    "linkedin": "https://www.linkedin.com/in/hari-prasad-kannan",
    "github": "https://github.com/harikannan512",
    "spotify": "https://open.spotify.com/user/216chsph2ubdymk4yahcc3i4a",
    "description": "I am originally from Delhi, and I am quite interested in video games, anime, football, public transport and infrastructure. I am an inquisitive software engineer with a passion to keep on learning new skills and grow as a person and a professional. Currently based in Maidenhead and working as a Software Engineer at WEX Inc UK",
    "education": [
        {
            "qualification": "BTech, Power Engineering",
            "institute": "Guru Gobind Singh Indraprastha University",
            "year": "2020",
            "result": "8.2/10"
        },
        {
            "qualification": "XII - Central Board of Secondary Education (CBSE)",
            "institute": "Evergreen Public School, Delhi",
            "year": "2018",
            "result": "87.6%"
        }
    ],
    "experience": [
        {
            "company": "WEX Inc",
            "position": "Software Engineer",
            "date": "Mar 2021 - Present",
            "footnote": "London, United Kingdom",
            "description": [
                "Streamlined the microservices stack by adding telemetry and service discovery solutions to the stack using Consul Connect, Prometheus, Grafana and Alert Manager to assist with a secure adoption of microservices architecture",
                "Took responsibility for EMEA pilot delivery, including designing and developing various requirements in the aforementioned microservices stack, demonstrating improvements in delivery time of up to 20%",
                "Designed and implemented custom OAuth2-based authentication workflow using Okta OIDC",
                "Assumed ownership of an in-house framework for running batch jobs based on Cron Scheduler. Reduced scheduling costs in the aforementioned EMEA delivery by completely replacing and improving the proprietary scheduler. Continue to provide training and consultation for adoption across different business areas within the company, working with different teams from different organisations",
                "Worked on integrating multiple business partners into a new EV platform creating a client-agnostic system. Created an extensible Kafka interface for this EV platform and worked across different teams",
                "Designed and implemented custom OAuth2-based authentication workflow using Okta OIDC"
            ]
        },
        {
            "company": "Secure Meters Ltd",
            "position": "Graduate Electrical Engineer",
            "date": "Jul. 2020 - Feb. 2021",
            "footnote": "New Delhi, India",
            "description": [
                "Research electricity and business-related policies in South-East Asia. Market research in various countries for smart-metering and AMR implementation opportunities. Handle the demands of different clients with the appropriate Meter technical specifications as per the International IEC Standards as required"
            ]
        },
        {
            "company": "Secure Meters Ltd",
            "position": "Intern",
            "date": "Jan. 2020 - Jun. 2020",
            "footnote": "New Delhi, India",
            "description": [
                "Suggested multiple improvements in functional and protective equipment inventory and made workflow improvements in equipment logistics to improve electrical installation and erection efficiency by 27% on average"
            ]
        }
    ],
    "skills": [
        {
            "name": "Languages",
            "list": [
                " Java/ J2EE","Python", "SQL", "Dart", "JS/TS", "GoLang"
            ]
        },
        {
            "name": "Dev Tools",
            "list": [
               " Git/ Github", "Docker", "Kubernetes", "Consul", "Prometheus", "Liquibase", "UNIX/ Linux", "Maven"
            ]
        },
        {
            "name": "Frameworks",
            "list": [
                "Spring Boot", "Spring Batch", "Angular", "Preact", "freshJS", "JUnit", "Mockito", "MongoDB", "Kafka", "Flutter"
            ]
        }
    ],
    "certifications": [
        {
            "name": "",
            "footnote": "",
            "date": ""
        }
    ],
    "projects": [
        {
            "name": "Open Source Contributions",
            "footnote": "Go, Git, Docker",
            "date": "Dec 2022 onwards",
            "link": "https://github.com/harikannan512",
            "description":[
                "Contribute to Cloud Native Computing Foundation based OSS projects in Go like containers/podman, buildpacks/pack and open-policy-agent/opa"
            ]
        },        {
            "name": "Reddit Clone App",
            "footnote": "Java, Typescript, Angular, Sprint Boot, PostgreSQL, Git",
            "date": "Nov 2020 - Jan 2021",
            "link": "https://github.com/harikannan512/FccReddit",
            "description":[
                "Created a Reddit clone using RESTful backend and a single page application frontend",
                "Developed in Java using Spring Boot, Hibernate ORM for persistence in PostgreSQL database in the backend and TypeScript using Angular framework in the front end"
            ]
        },
        {
            "name": "Travel Blog",
            "footnote": "Python, Django, Ninja, PostgreSQL, Git",
            "date": "May 2020 - Aug 2020",
            "link": "https://github.com/harikannan512/travelblog",
            "description":[
                "A web app with user sessions where for blogging travel stories online where users can write, view, edit and delete posts made by them, along with customising their account profile",
                "Developed in Python using Django (Python) in the backend, HTML/CSS in the frontend, PostgreSQL database"
            ]
        }
    ]
}